%{
Nα γραφεί ένα πρόγραμμα MATLAB για τον υπολογισμό της σειράς Fourier που
αντιστοιχεί σε σήμα πεπερασμένης διάρκειας Τ. Το σήμα να προσδιορίζεται ως
όρισμα και για τον υπολογισμό να χρησιμοποιείται η προσέγγιση του Διακριτού
Μετασχηματισμού Fourier που υλοποιεί η συνάρτηση fft.
%}

clear all % Καθαρισμός της μνήμης

dt = 0.0001; % Ορισμός περιόδου δειγματοληψίας

% Διάστημα δειγματοληψίας σήματος
t_max = 0.1;
t = -t_max:dt:t_max;

% Τα δείγματα του σήματος cos(100*pi*t) + cos(200*pi*t) + sin(500*pi*t) αποθηκεύονται στον πίνακα x
x = input('Δώστε παρακαλώ το σήμα x(t): ');

X = fft(x); % Υπολογισμός του ΔΜF του παραπάνω σήματος

figure('Name','To αρχικό σήμα');

plot(t,x); % Δημιουργία γραφικής αναπαράστασης του αρχικού σήματος

figure('Name','Υπολογισμός σειράς Fourier σήματος');

plot(t,X); % Δημιουργία γραφικής αναπαράστασης του αποτελέσματος του ΔΜF του σήματος