%{
Nα γραφεί ένα πρόγραμμα MATLAB για τον υπολογισμό της σειράς Fourier που
αντιστοιχεί σε σήμα πεπερασμένης διάρκειας Τ. Το σήμα να προσδιορίζεται ως
όρισμα και για τον υπολογισμό να χρησιμοποιείται η προσέγγιση του Διακριτού
Μετασχηματισμού Fourier που υλοποιεί η συνάρτηση fft.
%}

clear all % Καθαρισμός της μνήμης

dt = 0.0001; % Ορισμός περιόδου δειγματοληψίας

% Διάστημα δειγματοληψίας σήματος: [-0.1,0.1]
t_max = 0.1;
t = -t_max:dt:t_max;

% O χρήστης δίνει την συνάρτηση x(t) του σήματος
% Τα δείγματα του σήματος αποθηκεύονται στον πίνακα x
x = input('Δώστε παρακαλώ το σήμα x(t): ');

X = fft(x); % Υπολογισμός του διακριτού μετασχηματισμού Fourier του παραπάνω σήματος x

figure('Name','To αρχικό σήμα x(t)');

plot(t,x); % Δημιουργία γραφικής αναπαράστασης του αρχικού σήματος

figure('Name','Υπολογισμός σειράς Fourier του σήματος');

plot(t,X); % Δημιουργία γραφικής αναπαράστασης του αποτελέσματος του ΔΜF του σήματος