%{
Nα γραφεί ένα πρόγραμμα MATLAB για τον υπολογισμό της σειράς Fourier που
αντιστοιχεί σε σήμα πεπερασμένης διάρκειας Τ. Το σήμα να προσδιορίζεται ως
όρισμα και για τον υπολογισμό να χρησιμοποιείται η προσέγγιση του Διακριτού
Μετασχηματισμού Fourier που υλοποιεί η συνάρτηση fft.
%}

first = [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20]; % Έστω first το αρχικό σήμα

X = fft(first); % Υπολογισμός του ΔΜF του σήματος first

figure('Name','Υπολογισμός σειράς Fourier σήματος'); % Δημιουργία νέου παραθύρου

plot(X); % Δημιουργία γραφικής αναπαράστασης του αποτελέσματος του ΔΜF του σήματος

title('Υπολογισμός ΔΜF του σήματος')
