%{
Να γραφεί ένα πρόγραμμα MATLAB για την αντιστροφή δεδομένης σειράς Fourier.
Το πρόγραμμα θα δέχεται ως είσοδο ένα διάνυσμα με τους συντελεστές της
σειράς, τη θεμελιώδη συχνότητα, καθώς και τον επιθυμητό αριθμό συντελεστών
στον τύπο αντιστροφής.
%}

clear all % Καθαρισμός της μνήμης

% συντελεστές
%b = [ 21.0000,-3.0000 + 5.1962i,-3.0000 + 1.7321i,-3.0000,-3.0000 - 1.7321i, -3.0000 - 5.1962i]; 
%{
t = -0.1:0.0001:0.1; % διαστημα δειγματων

F = 2001 % frequency F=1/T

n = 1:1:length(b); % αριθμος δειγμάτων
y = zeros(1,length(t));

for k=1:1:length(t)
    y(k) = F*b*(exp(-i*2*pi*n*F*t(k)))'; % πολλαπλασιασμός πινάκων
end
%}
b = y1  

len = length(b); % Αποθήκευση του πλήθος των στοιχείων του πίνακα X στην μεταβλητή len

% Δημιουργία δύο πινάκων y και z με στοιχεία από το 0 έως και το len-1 με βήμα 1
y = [0:1:len-1]; 
z = [0:1:len-1];

% Υπολογισμός του αποτελέσματος με βάση τον τύπο του αντίστροφου
% μετασχηματισμού Fourier

yz =   y'*z; % Πολλαπλασιασμός του ανάστροφου πίνακα y με τον πίνακα z

W1 = exp(-j*2*pi/len); 
                      
W2 = W1 .^ (-yz);

result = (b * W2)/len;

figure('Name','Αντιστροφή δεδομένης σειράς Fourier'); % Δημιουργία νέου παραθύρου

plot(t,result); % Δημιουργία γραφικής αναπαράστασης του αποτελέσματος
