%{
Να γραφεί ένα πρόγραμμα MATLAB για την αντιστροφή δεδομένης σειράς Fourier.
Το πρόγραμμα θα δέχεται ως είσοδο ένα διάνυσμα με τους συντελεστές της
σειράς, τη θεμελιώδη συχνότητα, καθώς και τον επιθυμητό αριθμό συντελεστών
στον τύπο αντιστροφής.
%}

clear all % Καθαρισμός της μνήμης

% Eδω θα περιλαμβάνονται οι συντελεστές της σειράς
signal_vector = input('Εισάγετε τους συντελεστές της σειράς: ', 's');

% Μετατροπή κάθε κόμματος σε κενό
signal_vector = strrep(signal_vector, ',', ' ');

% Μετατροπή των strings σε αριθμούς
signal_vector = sscanf(signal_vector, '%f');

signal_vector = signal_vector';

% Εισαγωγή της θεμελιώδους συχνότητας
frequency = input('Εισάγετε την θεμελιώδη συχνότητα: ');

% Εισαγωγή επιθυμητού αριθμού συντελεστών στον τύπο αντιστοφής
desired_number = input('Εισάγετε τον επιθυμητό αριθμό συντελεστών στον τύπο αντιστροφής: ');

result = myFunction(signal_vector,frequency,desired_number);

t = 0:1:desired_number-1 % Χρονικές στιγμές δειγμάτων

figure('Name','Αντιστροφή δεδομένης σειράς Fourier');

plot(t,result); % Δημιουργία γραφικής αναπαράστασης του αποτελέσματος

function [iSF]=myFunction(Signal,fs,n)
    [iSF]=(1/fs).*ifft(Signal,n);
end


