%{
Να επιλεγεί ως σήμα ο χαρακτήρας ASCII που αντιστοιχεί στο πρώτο γράμμα του
επωνύμου σας και να επαληθευτούν τα προγράμματα του ερωτήματος 1 και 2.
%}

clear all

t = 0:1:40; % Κάθε παλμός διαρκεί 5 μονάδες χρόνου

y = zeros(1,length(t)) % Ορισμός πίνακα με μηδενικά

% Δημιουργία του σήματος χαρακτήρα ASCII
for k=1:1:length(t)
    y(k) = f(t(k)) 
end

figure('Name','Σήμα χαρακτήρα ASCII');
plot(t,y); % Δημιουργία γραφικής αναπαράστασης του αποτελέσματος
    
% Η συνάρτηση αυτή δίνει το σήμα του πρώτου χαρακτήρα ASCII του
% επωνύμου μου (Κ). Έχουμε επιλέξει την δυαδική αναπαράσταση του 
% χαρακτήρα αυτού που είναι η εξής: 01001011
function Y=f(t)
    if (0<=t && t<5 || 10<t && t<20 || 25<t && t<30)
        Y=0;
    else
        Y=1;
    end
end


