%{
Να επιλεγεί ως σήμα ο χαρακτήρας ASCII που αντιστοιχεί στο πρώτο γράμμα του
επωνύμου σας και να επαληθευτούν τα προγράμματα του ερωτήματος 1 και 2.
%}

clear all % Καθαρισμός της μνήμης

t = 0:1:40; % Πίνακας 41 θέσεων με όνομα t (έχει στοιχεία από το 0 έως και το 40)
y = zeros(1,length(t)) % Ορισμός ενός πίνακα με μηδενικά

% Δημιουργία ενός σήματος (παλμός) του χαρακτήρα ASCII "Κ" που έχει δυαδική
% μορφή: 01001011	
for k=1:1:length(t)
    y(k) = f(t(k)) 
end

figure('Name','Σήμα χαρακτήρα ASCII Κ'); % Δημιουργία νέου παραθύρου
plot(t,y); % Δημιουργία γραφικής αναπαράστασης του αποτελέσματος

% Η συνάρτηση αυτή δίνει το σήμα του πρώτου χαρακτήρα ASCII του
% επωνύμου μου "Κ" (από το επώνυμο Καρκάνης). Έχουμε επιλέξει την δυαδική αναπαράσταση του 
% χαρακτήρα αυτού που είναι η εξής: 01001011
function Y=f(t)
    if (0<=t && t<5 || 10<=t && t<20 || 25<=t && t<30 || t == 40)
        Y=0;
    else
        Y=1;
    end
end