%{
Να γραφεί ένα πρόγραμμα MATLAB για την αντίστροφή δεδομένης σειράς Fourier.
Το πρόγραμμα θα δέχεται ως είσοδο ένα διάνυσμα με τους συντελεστές της
σειράς, τη θεμελιώδη συχνότητα, καθώς και τον επιθυμητό αριθμό συντελεστών
στον τύπο αντιστροφής.
%}

% Δεδομένα εισόδου
X = [ 21.0000,-3.0000 + 5.1962i,-3.0000 + 1.7321i,-3.0000,-3.0000 - 1.7321i, -3.0000 - 5.1962i];

len = length(X); % Αποθήκευση του πλήθος των στοιχείων του πίνακα X στην μεταβλητή len

% Δημιουργία δύο πινάκων y και z με στοιχεία από το 0 έως και το len-1 με βήμα 1
y = [0:1:len-1]; 
z = [0:1:len-1];

% Υπολογισμός του αποτελέσματος με βάση τον τύπο του αντίστροφου
% μετασχηματισμού Fourier

yz =   y'*z; % Πολλαπλασιασμός του ανάστροφου πίνακα y με τον πίνακα z

W1 = exp(-j*2*pi/len); 
                      
W2 = W1 .^ (-yz);

result = (X * W2)/len;

figure('Name','Αντιστροφή δεδομένης σειράς Fourier'); % Δημιουργία νέου παραθύρου

plot(result); % Δημιουργία γραφικής αναπαράστασης του αποτελέσματος

title('Aντιστροφή σειράς Fourier');
